test/request-response-samples/Dummy__should_handle_attributes_in_request/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tns="http://www.Dummy.com" xmlns:n="http://www.Dummy.com/Name/Types"><soap:Header></soap:Header><soap:Body><n:DummyRequest xmlns:n="http://www.Dummy.com/Name/Types" xmlns="http://www.Dummy.com/Name/Types"><n:DummyField1 language="en-US">Humpty</n:DummyField1><n:DummyFilter><c:DummyFilterString xmlns:c="http://www.Dummy.com/Common/Types">Dumpty</c:DummyFilterString></n:DummyFilter></n:DummyRequest></soap:Body></soap:Envelope>